{
    "basics":{
       "email":"t.haferlach@gmail.com",
       "phone":"+49 (0)176 58158410",
       "profiles":[
          {
             "network":"Instagram",
             "username":"thomash_voodoo",
             "url":"https://instagram.com/thomash_voodoo/"
          }
       ],
       "summary":"After studying Computer Science & Artificial Intelligence at Edinburgh University, I spent 9 years in São Paulo creating an art collective that mixes alternative art and technology. Always keeping one foot in the technology sector, I conceived and implemented a variety of interactive installations, combining my passion for art, research, and technology.\n\nAfter settling back in Germany and I shifted my focus to research and technology again and recently completed a project which involved researching the future trends of Artificial Intelligence for the World Government summit in Dubai.  Having interned at Sun Microsystems and worked at Amazon after University, I have a strong background in Java and agile development practices. More recently, I have created artistic experiences involving a variety of technologies, including Node.js, Functional Reactive Programming, Python, machine learning, intelligent sensors, data visualization, distributed computing, physics engines, and spatialized sound. \n",
       "birthDate":"2018-06-30",
       "location":{
          "address":"Berlin, Berlin, Germany"
       },
       "category":"basics",
       "name":"Thomas Haferlach",
       "label":"Machine Learning, Interactive Installations, Computer Science, Event Production, Audio/visual"
    },
    "publications":[
       {
          "url":"https://www.researchgate.net/publication/251147936_Low_Level_Approaches_to_Cognitive_Control",
          "category":"publications",
          "name":"Low Level Approaches to Cognitive Control",
          "summary":"We describe several neural network implementions of insect based methods of navigation. We present the preliminary results of modelling associative learning capabilities based on the insect mushroom bodies.",
          "publisher":"Spatial Temporal Patterns for Action-Oriented Perception in Roving Robots",
          "releaseDate":"2009-01-31",
          "authors":"B. Webb, J. Wessnitzer, H. Rosano, M. Szenher, M. Zampoglou, T. Haferlach, P. Russo"
       },
       {
          "url":"https://link.springer.com/article/10.1007/s10710-008-9063-0",
          "category":"publications",
          "name":"The 2007 IEEE CEC simulated car racing competition",
          "summary":"With this paper, we hope to provide some insight into the efficacy of various computational intelligence methods on a well-defined game task, as well as an example of one way of running a competition. In the process, we provide a set of reference results for those who wish to use the simplerace game to benchmark their own algorithms. \n",
          "publisher":"Genetic Programming and Evolvable Machines",
          "releaseDate":"2008-03-31",
          "authors":"J. Togelius, S. Lucas, T.Haferlach, ..."
       },
       {
          "url":"http://journals.sagepub.com/doi/abs/10.1177/1059712307082080",
          "category":"publications",
          "authors":"T. Haferlach, J. Wessnitzer, M. Mangan & B. Webb",
          "name":"Evolving a Neural Model of Insect Path Integration",
          "summary":"We use a genetic algorithm to evolve a novel neural model of path integration, based on input from cells that encode the heading of the agent in a manner comparable to the polarization-sensitive interneurons found in insects. The home vector is encoded across a circular array of cells that integrate this input. We demonstrate the capabilities of the network under noisy conditions in simulation and on a robot.",
          "publisher":"Adaptive Behaviour 15(3)",
          "releaseDate":"2007-03-31"
       }
    ],
    "work":[
       {
          "locationName":"Berlin Area, Germany",
          "category":"work",
          "company":"Envisioning",
          "summary":"Currently researching technologies that will impact sustainability in the medium- and long-term future for the GIZ (Deutsche Gesellschaft fuer Internationale Zusammenarbeit) in Germany.",
          "position":"Foresight Researcher",
          "startDate":"2018-09-30"
       },
       {
          "locationName":"Berlin Area, Germany",
          "category":"work",
          "company":"Envisioning",
          "summary":"Researched future trends of Artificial Intelligence for the World Government Summit in Dubai.",
          "position":"Foresight Researcher",
          "startDate":"2018-09-30",
          "endDate":"2018-11-30"
       },
       {
          "locationName":"Montreal, Canada Area",
          "category":"work",
          "company":"MUTEK",
          "summary":"Conceived the live visuals for the band \"Die Wilde Jagd\" by creating a system that visualizes audio using Deep Neural Networks. Subsequently got  invited to give a talk on applications of AI with art at the Frontiere IA conference in Montreal",
          "position":"Talk about Artificial Intelligence and Art at the Frontiere IA Conference",
          "startDate":"2018-05-31",
          "endDate":"2018-06-30"
       },
       {
          "locationName":"Berlin Area, Germany",
          "category":"work",
          "company":"transmediale - art & digital culture",
          "summary":"Conceived and performed a musical piece which used the smartphones of the attendees to listen and react by generating sounds. This resulted in a form of musical swarm intelligence which blurs the border between performer and participant.\n\nhttp://www.ctm-festival.de/festival-2018/transfer/musicmakers-hacklab/",
          "position":"Machine Learning and Music  - Limited Contract Project",
          "startDate":"2018-03-31",
          "endDate":"2018-03-31"
       },
       {
          "locationName":"São Paulo Area, Brazil",
          "category":"work",
          "company":"Voodoohop",
          "summary":"As one of the founders of the multidisciplinary art collective Voodoohop, I became deeply involved with the art and music scene of São Paulo and Brazil. Guided by a hedonistic attitude that stimulates individual and joint freedom of expression, Voodoohop is enjoying international success with performances at events all over Europe, the USA, South America and a sold out physical release in Japan.\n\nAs a musician I perform live, mixing South American elements with contemporary electronica. I have created a unique live performance in which Software I developed is responsible for generating harmony, melody and modifying the musical arrangements in real time.",
          "position":"Artist and Organizer",
          "startDate":"2010-01-31",
          "endDate":"2018-12-31"
       },
       {
          "locationName":"Brazil",
          "category":"work",
          "company":"SuperUber (Rio de Janeiro), Conception (Rio de Janeiro), TIM (São Paulo), City of São Paulo",
          "summary":"Conceived and developed a range of interactive installations using technologies including machine learning, computer vision, distributed computing and alternative controllers.\n\nFor ArtRio I developed an installation that let participants paint on a blank canvas using their voice and head movements with the help of camera tracking and a microphone. \nhttps://vimeo.com/77349535\n\nFor TIM mobile I developed an OpenGL based mountain climbing game in which a user used both hands with a pair of Wii controllers. In an installation for the world cup people were able to take a selfie with the official mascot being superimposed onto the image using image recognition and processing.\n\nFor superuber I developed interactive installations such as letting users draw in simulated sand, create a song with their silhouette from loops by dancing in front of a camera\n\ntech: javascript × groovy × java × actionscript × node.js × meteor × opengl ×  alternative controllers",
          "position":"Freelance Developer",
          "startDate":"2008-03-31",
          "endDate":"2016-03-31"
       },
       {
          "locationName":"Edinburgh, United Kingdom",
          "category":"work",
          "company":"The University of Edinburgh",
          "summary":"Implementation of my thesis \"Evolving a Neural Model of Insect Path Integration\" on a physical robot and publication in the journal \"Adaptive Behavior\".\n\nhttp://journals.sagepub.com/doi/abs/10.1177/1059712307082080",
          "position":"Research and publication of my bachelor thesis ",
          "startDate":"2007-06-30",
          "endDate":"2007-10-31"
       },
       {
          "locationName":"Edinburgh, United Kingdom",
          "category":"work",
          "company":"Amazon",
          "summary":"Agile development of backend tooling. A/b testing of data mining technologies for sales optimization.\n\nTech: java × spring framework × test driven development × agile development × python × distributed computing",
          "position":"Software Engineer",
          "startDate":"2006-10-31",
          "endDate":"2007-02-28"
       },
       {
          "locationName":"Portland, Oregon Area",
          "category":"work",
          "company":"Sun Microsystems",
          "summary":"Worked as a team developer on several inner process projects.\n\nResearched and developed a prototype failure analysis classification engine using technologies from the field of data mining and machine learning.\n\nTech: java ×  spring framework ×  test driven development ×  agile development ×  python ×  distributed computing ",
          "position":"Software Engineer",
          "startDate":"2004-08-31",
          "endDate":"2005-07-31"
       }
    ],
    "education":[
       {
          "category":"education",
          "institution":"The University of Edinburgh",
          "studyType":"Bachelor of Science",
          "area":"Artificial Intelligence and Computer Science",
          "summary":"Modules: Artificial Intelligence, Computer Science, Mathematics, Physics, Advanced Vision, Computational Complexity, Intelligent Autonomous Robotics, Modelling and Simulation, Visualization, Neural Computation\n\nExtra: French, Human Communication\n\nThesis: Evolving Neural Models of Path Integration",
          "startDate":"2001-01-31",
          "endDate":"2006-01-31",
          "gpa":"First class honors"
       },
       {
          "category":"education",
          "institution":"Albert­ Schweitzer­ Gymnasium, Kassel",
          "studyType":"Abitur",
          "summary":"Main subjects: Mathematics, Physics, History, English \nSubsidiary subjects: Philosophy, Informatics, Social Science, Music\n\nAwarded honorary membership of the German Physics Society",
          "startDate":"1995-01-31",
          "endDate":"2001-01-31",
          "gpa":"grade 1.7"
       }
    ],
    "languages":[
       {
          "category":"languages",
          "language":"English",
          "fluency":"Native speaker"
       },
       {
          "category":"languages",
          "language":"Portuguese",
          "fluency":"Full professional"
       },
       {
          "category":"languages",
          "language":"French",
          "fluency":"Limited working knowleedge"
       },
       {
          "category":"languages",
          "language":"German",
          "fluency":"Native speaker"
       }
    ],
    "awards":[
       {
          "category":"awards",
          "title":"The 2007 IEEE CEC Simulated Car Racing Competition (2nd Place)",
          "date":"2007-06-30",
          "awarder":"IEEE Congress on Evolutionary Computation",
          "summary":"Trained a neural network based agent to compete successfully in an online car racing competition."
       },
       {
          "category":"awards",
          "title":"Honorary Membership",
          "date":"2001-05-31",
          "awarder":"German Physics Society"
       }
    ]
 }