{
	"Hello": "Hallo",
	"Email": "Email",
	"Phone": "Telefon",
	"Address": "Adresse",
	"City": "Stadt",
	"Berlin": "Berlin",
	"Country": "Land",
	"Germany": "Deutschland",
	"Profiles": "Profile",
	"Summary": "Zusammenfassung",
	"I am passionate about multidisciplinary research and development involving machine learning, distributed systems, art, and data visualization. By combining pragmatic problem-solving skills with a strong background in software engineering, I am able to apply cutting edge academic research in practice.": "Ich bin begeistert von multidisziplinärer Forschung und Entwicklung, die Machhine Learning, distributes Systems, Kunst und Datenvisualisierung umfasst. Durch die Kombination von Fähigkeiten zur pragmatischen Problemlösung mit Softwareentwicklung kann ich den letzten stand der Forschung in die Praxis umsetzen.",
	"Work & Research Experience": "Arbeits- und Forschungserfahrung",
	"Researched [future trends of Artificial Intelligence](https://viz.envisioning.io/wgs-ai/?o=0)   for the World Government Summit in Dubai drawing on academic papers, news and science fiction.\n\nCurrently investigating technologies that will impact sustainability in the medium- and long-term future for the GIZ (Deutsche Gesellschaft fuer Internationale Zusammenarbeit) in Germany.": "Recherchierte [Zukunftstrends der künstlichen Intelligenz](https://viz.envisioning.io/wgs-ai/?o=0) für den World Government Summit in Dubai basierend auf wissenschaftlichen Publikationen, News und Science Fiction.\n\nMomentan recherchiere ich Technologien fuer die Deutsche Gesellschaft für Internationale Zusammenarbeit, die sich mittel- und langfristig auf nachhaltige Entwicklung auswirken.",
	"Montreal, Canada Area": "Montreal, Kanada und Umgebung",
    "Conceived the live visuals for the band \"Die Wilde Jagd\" by creating a system that visualizes audio using Deep Neural Networks. Subsequently got invited to give a talk on applications of AI with art at the Frontière IA conference in Montreal": "Konzeption der Live-Visuals für die Band \"Die Wilde Jagd\" durch ein System, das Audio mithilfe von Deep Neural Networks visualisiert. Anschließend wurde ich eingeladen, auf der Konferenz Frontière IA in Montreal einen Vortrag über Anwendungen der KI mit Kunst zu halten",
	"Berlin Area, Germany": "Berlin und Umgebung, Deutschland",
	"Conceived and performed a musical piece which used the smartphones of the attendees to listen and react by generating sounds. This resulted in a form of musical swarm intelligence which blurs the border between performer and participant.": "Konzeption eines Musikstücks, bei dem die Smartphones der Teilnehmer zum Zuhören und Antworten durch das Erzeugen von Klängen verwendet wurden. Dies führte zu einer Art musikalischer Swarm Intelligence, die die Grenze zwischen Performer und Publikum hinterfragt.",
	"São Paulo Area, Brazil": "São Paulo und Umgebung, Brasilien",
    "As one of the founders of the multidisciplinary art collective Voodoohop, I became deeply involved with the art and music scene of São Paulo and Brazil. Guided by the principle of stimulating individual and joint freedom of expression, Voodoohop is enjoying international success with performances at events all over Europe, the USA, South America and a sold out physical release in Japan.\n\nAs a musician, I have created a unique live performance in which software I developed is responsible for generating harmony, melody and modifying the musical arrangements in real time.": "Als einer der Gründer des multidisziplinären Kunstkollektivs Voodoohop beschäftigte ich mich intensiv mit der Kunst- und Musikszene von São Paulo und Brasilien. Die Foerderung der individuellen und gemeinsamen Meinungsfreiheit stand im Vordergrund und Voodoohop wurde mit Veranstaltungen in ganz Europa, den USA, Südamerika und eines ausverkauften Releases in Japan international erfolgreich.\n\nAls multimedia-Kuenstler habe ich eine einzigartige Live-Performance entwickelt, in der eine von mir entwickelte Software dafür verantwortlich ist, Harmonie, Melodie zu erzeugen und die musikalischen Arrangements in Echtzeit zu verändern.",
	"Brazil": "Brasilien",
	"Conceived and developed a range of interactive installations using technologies including machine learning, computer vision, distributed computing, controllers, sensors, embedded computing and data visualization.\n\n**Examples:**\n1. With the help of facial tracking, a microphone and pitch analysis, participants could [paint on a blank canvas](https://vimeo.com/77349535) using their voice and head movements. \n2. An OpenGL based climbing game in which [a user climbs a mountain](https://vimeo.com/20260318) using the movement of his own hands \n3. For the 2014 FIFA World Cup, using computer vision and real-time image augmentation, participants [took selfies with the official mascot](https://vimeo.com/116658261) superimposed onto the image.": "Konzeption und Entwicklung einer Reihe interaktiver Installationen mit Technologien wie Machine Learning, Computer Vision, Distributed Computing, Controller, Sensoren, Embedded Computing und Datenvisualisierung.\n\n ** Beispiele: **\n1. Mit Hilfe von Facial Tracking, eines Mikrofons und Tonhöhenanalyse konnten Teilnehmer ihre Stimme und ihre Kopfbewegungen verwenden um [durch Singen auf eine Leinwand malen](https://vimeo.com/77349535).\n\n2. Ein auf OpenGL basierende Klettersimulator, in dem [ein Benutzer mit der Bewegung seiner eigenen Hände einen Berg besteigt](https://vimeo.com/20260318).\n\n3. Waehrend der Fußball-Weltmeisterschaft 2014 konnten Teilnehmer mit der Hilfe von Computer Vision und Echtzeit Video-augmentation [Selfies mit dem offiziellen WM-Maskottchen schiessen](https://vimeo.com/116658261)",
	"Edinburgh, United Kingdom": "Edinburgh, Vereinigtes Königreich",
    "Implementation of my thesis [Evolving a Neural Model of Insect Path Integration](https://journals.sagepub.com/doi/abs/10.1177/1059712307082080) on a physical robot and publication in the journal \"Adaptive Behavior\"": "Umsetzung meiner Arbeit [Evolving a Neural Model of Insect Path Integration](https://journals.sagepub.com/doi/abs/10.1177/1059712307082080) über einen physischen Roboter und Veröffentlichung in der Fachzeitschrift \"Adaptive Behavior\"",
	"Agile development of backend tooling, A/B testing and data mining for sales optimization.\n\nTechnologies: Java, Spring Framework, Test-Driven Development, Agile Development, Python, Distributed Computing": "Agile Entwicklung von Backend-Tools, A/B-Tests und Data Mining zur Verkaufsoptimierung.\n\nTechnologien: Java, Spring Framework, Testgetriebene Entwicklung, Agile Entwicklung, Python, Distributed Computing",
	"Portland, Oregon Area": "Portland, Oregon und Umgebung",
	"Worked as a team developer on several inner process projects.\n\nResearched and developed a prototype failure analysis classification engine using technologies from the field of data mining and machine learning.\n\nTechnologies: Java, Text Classification, Agile Development ": "Arbeitete an der Recherche und Entwicklung eines Prototyps zur Fehleranalyse basierend auf Technologien aus den Bereichen Data Mining und Machine Learning.\n\nTechnologien: Java, Textklassifizierung, agile Entwicklung",
	"Education": "Bildung",
	"Artificial Intelligence and Computer Science": "Künstliche Intelligenz und Informatik",
	"Bachelor of Science": "Bachelor of Science",
	"with": "mit",
	"Modules: Artificial Intelligence, Computer Science, Mathematics, Physics, Advanced Vision, Computational Complexity, Intelligent Autonomous Robotics, Modelling and Simulation, Visualization, Neural Computation\n\nExtra: French, Human Communication\n\nThesis: [Evolving Neural Models of Path Integration](https://journals.sagepub.com/doi/abs/10.1177/1059712307082080)": "Module: Künstliche Intelligenz, Informatik, Mathematik, Physik, Advanced Vision, Computational Complexity, Intelligente Autonome Robotik, Modellierung und Simulation, Visualisierung, Neural Computation\n\n Extra: Französisch, Human Communication\n\nThesis: [Entwicklung neuronaler Modelle der Pfadintegration](https://journals.sagepub.com/doi/abs/10.1177/1059712307082080)",
	"Abitur": "Abitur",
	"till": "bis",
	"Publications": "Veröffentlichungen",
	"We describe several neural network implementions of insect based methods of navigation. We present the preliminary results of modelling associative learning capabilities based on the insect mushroom bodies.": "We describe several neural network implementions of insect-based methods of navigation. We present the preliminary results of modelling associative learning capabilities based on the insect mushroom bodies.",
	"We use a genetic algorithm to evolve a novel neural model of path integration, based on input from cells that encode the heading of the agent in a manner comparable to the polarization-sensitive interneurons found in insects. The home vector is encoded across a circular array of cells that integrate this input. We demonstrate the capabilities of the network under noisy conditions in simulation and on a robot.": "We use a genetic algorithm to evolve a novel neural model of path integration, based on input from cells that encode the heading of the agent in a manner comparable to the polarization-sensitive interneurons found in insects. The home vector is encoded across a circular array of cells that integrate this input. We demonstrate the capabilities of the network under noisy conditions in simulation and on a robot.",
	"Awards & Projects": "Auszeichnungen & Projekte",
	"Harmonic Audio Mixing Visualization Tools": "Visualisierungstools für harmonisches Audiomixing",
	"Open-source project: An innovative way of analyzing and visualizing musical harmony using colors, waveforms and the harmonic circle. \n\nTechnologies: React - Max/MSP - Ableton Live - Electron - Node.js": "Open-Source-Projekt: Eine innovative Methode zur Analyse und Visualisierung musikalischer Harmonie anhand von Farben, Waveforms und des Quintenzirkels. Technologien: React - Max / MSP - Ableton Live - Electron - Node.js",
	"Simulated Car Racing Competition (2nd Place)": "Simulated Car Racing Competition (2. Platz)",
	"IEEE Congress on Evolutionary Computation": "IEEE Congress on Evolutionary Computation",
	"Trained a modular neural network architecture to control an agent that competed successfully in the IEEE CEC Simulated Car Racing Competition.": "Training eines modularen neuronalen Netzwerks zur Steuerung eines Agenten, der erfolgreich an der IEEE CEC Simulated Car Racing Competition teilnahm.",
	"Honorary Membership": "Ehrenmitglied",
	"German Physics Society": "Deutsche Physikalische Gesellschaft",
	"Languages": "Sprachen",
	"English": "Englisch",
	"Native speaker": "Muttersprache",
	"German": "Deutsche",
	"Portuguese": "Portugiesisch",
	"Full professional": "Fliessend",
	"French": "Französisch",
	"Basic conversational": "Gute Kenntnisse",
	"References": "Refefenzen",
	"Skills": "Kompetenzen",
	"Software Engineering": "Softwareentwicklung",
	"Agile Development, Object-Oriented Programming, Functional Programming, Distributed Computing, Full Stack Programming, Java, Javascript, Typescript, Python, SQL, NoSQL, Git, Node.js": "Agile Entwicklung, Objektorientierte Programmierung, Functional Programming, Distributed Computing, Full-Stack Programmierung, Java, Javascript, Typescript, Python, SQL, NoSQL, Git, Node.js",
	"Machine Learning": "Maschine Learning",
	"Artificial Neural Networks, Generative Models, Computer Vision, PyTorch (basic), Tensorflow (basic), Max/MSP, Audio Classification, Digital Signal Processing, Web Crawling, Data Processing Pipelines, Data Visualization, Applying academic research in practice": "Neuronale Netze, Generative Modelle, Computer Vision, PyTorch (Grundkenntnisse), Tensorflow (Grundkenntnisse), Max / MSP, Audioklassifizierung, Digitale Signalverarbeitung, Web-Crawling, Datenverarbeitungs-Pipelines, Datenvisualisierung, Anwendung wissenschaftlicher Forschung in der Praxis",
	"Soft Skills": "Soft Skills",
	"Working independently, Conveying technical information to a non-technical Audience, Logical thinking and problem solving, Excellent written and oral communication skills": "Selbständiges Arbeiten, Vermittlung technischer Informationen an ein nichttechnisches Publikum, Logisches Denken und Problemlösen, Ausgezeichnete schriftliche und mündliche Kommunikationsfähigkeiten",
	"Contact": "Kontakt",
	"Foresight Researcher": "Foresight-Forscher",
	"at": "beim",
	"Remote": "Remote",
	"Talk about Artificial Intelligence and Art at the Frontiere IA Conference": "Vortrag über künstliche Intelligenz und Kunst an der Konferenz Frontiere IA",
	"Machine Learning and Music Hacklab: Swarm Animism": "Maschinelles Lernen und Musik Hacklab: Swarm Animism",
	"Artist and Organizer": "Künstler und Organisator",
	"Freelance Developer": "Freiberuflicher Entwickler",
	"Research and publication of my bachelor thesis": "Forschung und Entwicklung meiner Bachelorarbeit",
	"Software Engineer": "Softwareentwickler",
	"Software Engineering Internship": "Software Engineering Praktikum",
	"<i>First class honors</i>": "<i>First class honors</i>",
	"grade 1.7": "Note 1,7"
}